const spilderHtml = require("./spilderHtml");
const spliderSplitHtml = require("./spliderSplitHtml");
const downLoadImgPart1 = require("./downLoadImgPart1");
const downLoadImgPart2 = require("./downLoadImgPart2");

// 定义爬虫方法入口
async function splider() {
  // 抓取首页,并返回抓取到的html文件存储路径
  const spliderHtmlFilePath = await spilderHtml("https://www.xidibuy.com/");

  console.log("——————————————开始解析目标文件！——————————————");
  console.log("——————————————开始解析目标文件！——————————————");
  console.log("——————————————开始解析目标文件！——————————————");
  console.log("——————————————开始解析目标文件！——————————————");
  console.log("——————————————开始解析目标文件！——————————————");
  console.log("——————————————开始解析目标文件！——————————————");
  console.log("——————————————开始解析目标文件！——————————————");
  console.log("——————————————开始解析目标文件！——————————————");
  console.log("——————————————开始解析目标文件！——————————————");

  // 使用cherrio模块，解析拆分抓取到的html文件
  await spliderSplitHtml(spliderHtmlFilePath);

  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");
  console.log("——————————————首页数据抓取分析完毕!——————————————");

  // 首页图片下载
  await downLoadImgPart1();

  await downLoadImgPart2();

  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
  console.log("——————————————首页图片资源下载完成!——————————————");
}

splider();
